{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "fd2f4fa6-11e4-4ed1-b734-215a9351385c",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext dotenv\n",
    "%dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "eb5cd849-5b12-44fe-932b-66f15898d561",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "import pandas as pd\n",
    "from ch08_tools import get_answer\n",
    "from datasets import Dataset\n",
    "from ragas import evaluate\n",
    "from ragas.metrics import (\n",
    "    answer_correctness,\n",
    "    context_recall,\n",
    "    faithfulness,\n",
    ")\n",
    "\n",
    "\n",
    "from tqdm import tqdm\n",
    "from utils import neo4j_driver\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f7917c60-279d-4fcf-ad6a-f2a379a6bde7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('Based on the information provided, Tom Hanks is the actor who has acted in the most movies, with a movie count of 12.',\n",
       " [{'role': 'assistant',\n",
       "   'content': 'For the question: \\'Which actor has acted in the most movies?\\', we have the answer: \\'[[{\"actor\": \"Tom Hanks\", \"movieCount\": 12}]]\\''},\n",
       "  {'role': 'assistant',\n",
       "   'content': 'For the question: \\'Who is the actor with the highest number of movie roles?\\', we have the answer: \\'[[{\"actor\": \"Tom Hanks\", \"numberOfRoles\": 20}]]\\''}])"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_answer(\"Who acted in the most movies?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "96ae8eca-d935-4897-8382-d1030401f0e9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hello</td>\n",
       "      <td>RETURN \"greeting and reminder it can only answ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What can you do?</td>\n",
       "      <td>RETURN \"answer questions related to movies and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>What is the weather like in Spain?</td>\n",
       "      <td>RETURN \"irrelevant question as we can answer q...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many movies are there?</td>\n",
       "      <td>MATCH (m:Movie) RETURN count(*) AS movies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Who acted in the most movies?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie)\\nRETUR...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Which movies released between 1990 and 2000 ha...</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.released &gt;= 1990 AND m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Who has the longest name among all actors?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(:Movie) RETURN ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>List people born before 1940.</td>\n",
       "      <td>MATCH (p:Person) WHERE p.born &lt; 1940 RETURN p....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Who was born in 1965 and has directed a movie?</td>\n",
       "      <td>MATCH (p:Person)-[:DIRECTED]-&gt;(m:Movie) WHERE ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Who acted in Top Gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Who acted in top gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>In which movies did Tom Hanks act in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>In which movies did tom Hanks act in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>List the movies with a title starting with \"The\"</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.title STARTS WITH \"The...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>How many movies did Tom Hanks appear in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Who played in the Matrix?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Which movie has the most Oscars?</td>\n",
       "      <td>RETURN \"This information is missing\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             question  \\\n",
       "0                                               Hello   \n",
       "1                                    What can you do?   \n",
       "2                  What is the weather like in Spain?   \n",
       "3                          How many movies are there?   \n",
       "4                       Who acted in the most movies?   \n",
       "5   Which movies released between 1990 and 2000 ha...   \n",
       "6          Who has the longest name among all actors?   \n",
       "7                       List people born before 1940.   \n",
       "8      Who was born in 1965 and has directed a movie?   \n",
       "9                               Who acted in Top Gun?   \n",
       "10                              Who acted in top gun?   \n",
       "11              In which movies did Tom Hanks act in?   \n",
       "12              In which movies did tom Hanks act in?   \n",
       "13   List the movies with a title starting with \"The\"   \n",
       "14           How many movies did Tom Hanks appear in?   \n",
       "15                          Who played in the Matrix?   \n",
       "16                   Which movie has the most Oscars?   \n",
       "\n",
       "                                               cypher  \n",
       "0   RETURN \"greeting and reminder it can only answ...  \n",
       "1   RETURN \"answer questions related to movies and...  \n",
       "2   RETURN \"irrelevant question as we can answer q...  \n",
       "3           MATCH (m:Movie) RETURN count(*) AS movies  \n",
       "4   MATCH (p:Person)-[:ACTED_IN]->(m:Movie)\\nRETUR...  \n",
       "5   MATCH (m:Movie) WHERE m.released >= 1990 AND m...  \n",
       "6   MATCH (p:Person)-[:ACTED_IN]->(:Movie) RETURN ...  \n",
       "7   MATCH (p:Person) WHERE p.born < 1940 RETURN p....  \n",
       "8   MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE ...  \n",
       "9   MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...  \n",
       "10  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...  \n",
       "11  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...  \n",
       "12  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...  \n",
       "13  MATCH (m:Movie) WHERE m.title STARTS WITH \"The...  \n",
       "14  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...  \n",
       "15  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...  \n",
       "16               RETURN \"This information is missing\"  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_data = pd.read_csv(\"../data/benchmark_data.csv\", delimiter=\";\")\n",
    "test_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "071f082d-52d6-4e26-b158-52df8af1a670",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing rows: 100%|██████████| 17/17 [02:38<00:00,  9.33s/it]\n"
     ]
    }
   ],
   "source": [
    "answers = []\n",
    "ground_truths = []\n",
    "latencies = []\n",
    "contexts = []\n",
    "\n",
    "for i, row in tqdm(test_data.iterrows(), total=len(test_data), desc=\"Processing rows\"):\n",
    "    ground_truth, _, _ = neo4j_driver.execute_query(row[\"cypher\"])\n",
    "    ground_truths.append([str(el.data()) for el in ground_truth])\n",
    "    start = datetime.now()\n",
    "    try:\n",
    "        answer, context = get_answer(row[\"question\"])\n",
    "        context = [el['content'] for el in context]\n",
    "    except Exception:\n",
    "        answer, context = None, []\n",
    "    latencies.append((datetime.now() - start).total_seconds())\n",
    "    answers.append(answer)\n",
    "    contexts.append(context)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e98b4096-1740-4892-a43d-dc5fbceb149d",
   "metadata": {},
   "outputs": [],
   "source": [
    "test_data['ground_truth'] = [str(el) for el in ground_truths]\n",
    "test_data['answer'] = answers\n",
    "test_data['latency'] = latencies\n",
    "test_data['retrieved_contexts'] = contexts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c4ba84fe-e23a-48b0-adeb-6942ed3fdaa5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "2781c060c24748028b7f7ba4b19a1a9c",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating:   0%|          | 0/51 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "No statements were generated from the answer.\n",
      "No statements were generated from the answer.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'answer_correctness': 0.3741, 'context_recall': 0.8235, 'faithfulness': 0.9333}\n"
     ]
    }
   ],
   "source": [
    "dataset = Dataset.from_pandas(test_data.fillna(\"I don't know\"))\n",
    "result = evaluate(\n",
    "    dataset,\n",
    "    metrics=[\n",
    "        answer_correctness,\n",
    "        context_recall,\n",
    "        faithfulness,\n",
    "    ],\n",
    ")\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "61e5598b-26e1-4113-a1e6-0c24ddd9743d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>ground_truth</th>\n",
       "      <th>answer</th>\n",
       "      <th>latency</th>\n",
       "      <th>retrieved_contexts</th>\n",
       "      <th>answer_correctness</th>\n",
       "      <th>context_recall</th>\n",
       "      <th>faithfulness</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hello</td>\n",
       "      <td>RETURN \"greeting and reminder it can only answ...</td>\n",
       "      <td>['{\\'\"greeting and reminder it can only answer...</td>\n",
       "      <td>I can only answer questions about movies and t...</td>\n",
       "      <td>6.178697</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.196927</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What can you do?</td>\n",
       "      <td>RETURN \"answer questions related to movies and...</td>\n",
       "      <td>['{\\'\"answer questions related to movies and t...</td>\n",
       "      <td>I can provide information about movies and the...</td>\n",
       "      <td>8.185068</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.951261</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>What is the weather like in Spain?</td>\n",
       "      <td>RETURN \"irrelevant question as we can answer q...</td>\n",
       "      <td>['{\\'\"irrelevant question as we can answer que...</td>\n",
       "      <td>I can only answer questions about movies and t...</td>\n",
       "      <td>7.218710</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.208939</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many movies are there?</td>\n",
       "      <td>MATCH (m:Movie) RETURN count(*) AS movies</td>\n",
       "      <td>[\"{'movies': 38}\"]</td>\n",
       "      <td>There are a total of 38 movies.</td>\n",
       "      <td>7.844754</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.207443</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Who acted in the most movies?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie)\\nRETUR...</td>\n",
       "      <td>[\"{'p.name': 'Tom Hanks', 'movieCount': 12}\"]</td>\n",
       "      <td>The actor who acted in the most movies is Tom ...</td>\n",
       "      <td>8.651140</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.202747</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Which movies released between 1990 and 2000 ha...</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.released &gt;= 1990 AND m...</td>\n",
       "      <td>[]</td>\n",
       "      <td>The information is missing to answer the quest...</td>\n",
       "      <td>20.827205</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.185538</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Who has the longest name among all actors?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(:Movie) RETURN ...</td>\n",
       "      <td>[\"{'name': 'Philip Seymour Hoffman'}\"]</td>\n",
       "      <td>The information is missing to answer the quest...</td>\n",
       "      <td>11.523492</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.184055</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>List people born before 1940.</td>\n",
       "      <td>MATCH (p:Person) WHERE p.born &lt; 1940 RETURN p....</td>\n",
       "      <td>[\"{'p.name': 'Jack Nicholson'}\", \"{'p.name': '...</td>\n",
       "      <td>Here is a list of people born before 1940:\\n\\n...</td>\n",
       "      <td>3.828791</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.943400</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Who was born in 1965 and has directed a movie?</td>\n",
       "      <td>MATCH (p:Person)-[:DIRECTED]-&gt;(m:Movie) WHERE ...</td>\n",
       "      <td>[\"{'p.name': 'Lana Wachowski'}\", \"{'p.name': '...</td>\n",
       "      <td>The answer to the question 'Who was born in 19...</td>\n",
       "      <td>10.299058</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.193908</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Who acted in Top Gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "      <td>[\"{'p.name': 'Tom Cruise'}\", \"{'p.name': 'Kell...</td>\n",
       "      <td>The actors who acted in \"Top Gun\" are Tom Crui...</td>\n",
       "      <td>16.651134</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.197816</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Who acted in top gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "      <td>[\"{'p.name': 'Tom Cruise'}\", \"{'p.name': 'Kell...</td>\n",
       "      <td>The actors in the movie \"Top Gun\" are Tom Crui...</td>\n",
       "      <td>8.173920</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.198467</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>In which movies did Tom Hanks act in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "      <td>['{\\'m.title\\': \"You\\'ve Got Mail\"}', \"{'m.tit...</td>\n",
       "      <td>Tom Hanks acted in the following movies:\\n\\n1....</td>\n",
       "      <td>4.775766</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.947043</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>In which movies did tom Hanks act in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "      <td>['{\\'m.title\\': \"You\\'ve Got Mail\"}', \"{'m.tit...</td>\n",
       "      <td>Tom Hanks acted in the following movies:\\n\\n1....</td>\n",
       "      <td>4.700154</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.947043</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>List the movies with a title starting with \"The\"</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.title STARTS WITH \"The...</td>\n",
       "      <td>[\"{'m.title': 'The Birdcage'}\", \"{'m.title': '...</td>\n",
       "      <td>The movies with a title starting with \"The\" ar...</td>\n",
       "      <td>5.698031</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.203924</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>How many movies did Tom Hanks appear in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "      <td>[\"{'numberOfMovies': 12}\"]</td>\n",
       "      <td>Tom Hanks appeared in 12 movies.</td>\n",
       "      <td>11.431668</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.197400</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Who played in the Matrix?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "      <td>[\"{'p.name': 'Keanu Reeves'}\", \"{'p.name': 'Ca...</td>\n",
       "      <td>The actors who played in \"The Matrix\" are Kean...</td>\n",
       "      <td>7.029260</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.199265</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Which movie has the most Oscars?</td>\n",
       "      <td>RETURN \"This information is missing\"</td>\n",
       "      <td>['{\\'\"This information is missing\"\\': \\'This i...</td>\n",
       "      <td>The information is missing to answer the quest...</td>\n",
       "      <td>14.972982</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.194917</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             question  \\\n",
       "0                                               Hello   \n",
       "1                                    What can you do?   \n",
       "2                  What is the weather like in Spain?   \n",
       "3                          How many movies are there?   \n",
       "4                       Who acted in the most movies?   \n",
       "5   Which movies released between 1990 and 2000 ha...   \n",
       "6          Who has the longest name among all actors?   \n",
       "7                       List people born before 1940.   \n",
       "8      Who was born in 1965 and has directed a movie?   \n",
       "9                               Who acted in Top Gun?   \n",
       "10                              Who acted in top gun?   \n",
       "11              In which movies did Tom Hanks act in?   \n",
       "12              In which movies did tom Hanks act in?   \n",
       "13   List the movies with a title starting with \"The\"   \n",
       "14           How many movies did Tom Hanks appear in?   \n",
       "15                          Who played in the Matrix?   \n",
       "16                   Which movie has the most Oscars?   \n",
       "\n",
       "                                               cypher  \\\n",
       "0   RETURN \"greeting and reminder it can only answ...   \n",
       "1   RETURN \"answer questions related to movies and...   \n",
       "2   RETURN \"irrelevant question as we can answer q...   \n",
       "3           MATCH (m:Movie) RETURN count(*) AS movies   \n",
       "4   MATCH (p:Person)-[:ACTED_IN]->(m:Movie)\\nRETUR...   \n",
       "5   MATCH (m:Movie) WHERE m.released >= 1990 AND m...   \n",
       "6   MATCH (p:Person)-[:ACTED_IN]->(:Movie) RETURN ...   \n",
       "7   MATCH (p:Person) WHERE p.born < 1940 RETURN p....   \n",
       "8   MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE ...   \n",
       "9   MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...   \n",
       "10  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...   \n",
       "11  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...   \n",
       "12  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...   \n",
       "13  MATCH (m:Movie) WHERE m.title STARTS WITH \"The...   \n",
       "14  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...   \n",
       "15  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...   \n",
       "16               RETURN \"This information is missing\"   \n",
       "\n",
       "                                         ground_truth  \\\n",
       "0   ['{\\'\"greeting and reminder it can only answer...   \n",
       "1   ['{\\'\"answer questions related to movies and t...   \n",
       "2   ['{\\'\"irrelevant question as we can answer que...   \n",
       "3                                  [\"{'movies': 38}\"]   \n",
       "4       [\"{'p.name': 'Tom Hanks', 'movieCount': 12}\"]   \n",
       "5                                                  []   \n",
       "6              [\"{'name': 'Philip Seymour Hoffman'}\"]   \n",
       "7   [\"{'p.name': 'Jack Nicholson'}\", \"{'p.name': '...   \n",
       "8   [\"{'p.name': 'Lana Wachowski'}\", \"{'p.name': '...   \n",
       "9   [\"{'p.name': 'Tom Cruise'}\", \"{'p.name': 'Kell...   \n",
       "10  [\"{'p.name': 'Tom Cruise'}\", \"{'p.name': 'Kell...   \n",
       "11  ['{\\'m.title\\': \"You\\'ve Got Mail\"}', \"{'m.tit...   \n",
       "12  ['{\\'m.title\\': \"You\\'ve Got Mail\"}', \"{'m.tit...   \n",
       "13  [\"{'m.title': 'The Birdcage'}\", \"{'m.title': '...   \n",
       "14                         [\"{'numberOfMovies': 12}\"]   \n",
       "15  [\"{'p.name': 'Keanu Reeves'}\", \"{'p.name': 'Ca...   \n",
       "16  ['{\\'\"This information is missing\"\\': \\'This i...   \n",
       "\n",
       "                                               answer    latency  \\\n",
       "0   I can only answer questions about movies and t...   6.178697   \n",
       "1   I can provide information about movies and the...   8.185068   \n",
       "2   I can only answer questions about movies and t...   7.218710   \n",
       "3                     There are a total of 38 movies.   7.844754   \n",
       "4   The actor who acted in the most movies is Tom ...   8.651140   \n",
       "5   The information is missing to answer the quest...  20.827205   \n",
       "6   The information is missing to answer the quest...  11.523492   \n",
       "7   Here is a list of people born before 1940:\\n\\n...   3.828791   \n",
       "8   The answer to the question 'Who was born in 19...  10.299058   \n",
       "9   The actors who acted in \"Top Gun\" are Tom Crui...  16.651134   \n",
       "10  The actors in the movie \"Top Gun\" are Tom Crui...   8.173920   \n",
       "11  Tom Hanks acted in the following movies:\\n\\n1....   4.775766   \n",
       "12  Tom Hanks acted in the following movies:\\n\\n1....   4.700154   \n",
       "13  The movies with a title starting with \"The\" ar...   5.698031   \n",
       "14                   Tom Hanks appeared in 12 movies.  11.431668   \n",
       "15  The actors who played in \"The Matrix\" are Kean...   7.029260   \n",
       "16  The information is missing to answer the quest...  14.972982   \n",
       "\n",
       "                                   retrieved_contexts  answer_correctness  \\\n",
       "0   [For the question: 'Which actor has acted in t...            0.196927   \n",
       "1   [For the question: 'Which actor has acted in t...            0.951261   \n",
       "2   [For the question: 'Which actor has acted in t...            0.208939   \n",
       "3   [For the question: 'Which actor has acted in t...            0.207443   \n",
       "4   [For the question: 'Which actor has acted in t...            0.202747   \n",
       "5   [For the question: 'Which actor has acted in t...            0.185538   \n",
       "6   [For the question: 'Which actor has acted in t...            0.184055   \n",
       "7   [For the question: 'Which actor has acted in t...            0.943400   \n",
       "8   [For the question: 'Which actor has acted in t...            0.193908   \n",
       "9   [For the question: 'Which actor has acted in t...            0.197816   \n",
       "10  [For the question: 'Which actor has acted in t...            0.198467   \n",
       "11  [For the question: 'Which actor has acted in t...            0.947043   \n",
       "12  [For the question: 'Which actor has acted in t...            0.947043   \n",
       "13  [For the question: 'Which actor has acted in t...            0.203924   \n",
       "14  [For the question: 'Which actor has acted in t...            0.197400   \n",
       "15  [For the question: 'Which actor has acted in t...            0.199265   \n",
       "16  [For the question: 'Which actor has acted in t...            0.194917   \n",
       "\n",
       "    context_recall  faithfulness  \n",
       "0              0.0           1.0  \n",
       "1              1.0           1.0  \n",
       "2              1.0           1.0  \n",
       "3              1.0           1.0  \n",
       "4              1.0           0.5  \n",
       "5              0.0           0.5  \n",
       "6              1.0           1.0  \n",
       "7              1.0           1.0  \n",
       "8              1.0           1.0  \n",
       "9              1.0           1.0  \n",
       "10             1.0           1.0  \n",
       "11             1.0           NaN  \n",
       "12             1.0           1.0  \n",
       "13             1.0           NaN  \n",
       "14             1.0           1.0  \n",
       "15             1.0           1.0  \n",
       "16             0.0           1.0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for key in [\"answer_correctness\", \"context_recall\", \"faithfulness\"]:\n",
    "    test_data[key] = [el[key] for el in result.scores]\n",
    "test_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3997a6dc-1e66-4435-afcf-7b48014507f2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo4j",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
